Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Деньги
	Движения.Деньги.Записывать = Истина;
	Движение = Движения.Деньги.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплаты(СпособОплаты);
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажа") Тогда
		// Заполнение шапки
		Салон = ДанныеЗаполнения.Салон;
		Клиент = ДанныеЗаполнения.Клиент;
		Сумма = ДанныеЗаполнения.Сумма;
		Запись = ДанныеЗаполнения.Запись;

	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры

Функция ТипДенежныхСредствПоСпособуОплаты(СпособОплаты)
	
	Соответствие = Новый Соответствие;
	 
	Соответствие.Вставить(Перечисления.СпособыОплаты.Наличные,
		Перечисления.ТипыДенежныхСредств.Наличные);
		
	Соответствие.Вставить(Перечисления.СпособыОплаты.Карта,
		Перечисления.ТипыДенежныхСредств.Безналичные);
	
	Возврат Соответствие[СпособОплаты]
	
КонецФункции