#Область ОбработчикиСобытий
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбъектМетаданных = Метаданные.Перечисления.ДниНедели;   
	
	Для каждого ЗначениеПеречисления Из ОбъектМетаданных.ЗначенияПеречисления Цикл
	
		СтрокаТч = 	РежимРаботы.Добавить();
		СтрокаТч.ДеньНедели = Перечисления.ДниНедели[ЗначениеПеречисления.Имя];
		СтрокаТч.ВремяНачала =  "01.01.0001 09:00:00";       
		СтрокаТч.ВремяОкончания = "01.01.0001 19:00:00";

	КонецЦикла;  
	
КонецПроцедуры

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
#КонецОбласти

