#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиКОплате(Команда)

	ДокументЗаписан = Ложь;
	Если Объект.Ссылка.Пустая() Тогда
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);
	Иначе
		ДокументЗаписан = Истина;
	КонецЕсли;

	Если ДокументЗаписан Тогда
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму(
			"Документ.Оплата.ФормаОбъекта", СтруктураПараметров, , , , , ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти